Documents/ВедомостьЗП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ВедомостьЗП</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыССотрудниками</xr:Item>
				<xr:Item>AccumulationRegister.ВыплаченнаяЗарплата</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВыплатыЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеВедомостейЗП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентВыплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключаяСотрудниковЧерезБанк</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплатаАванса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКВыплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЛицевогоСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РучнаяКорректировка</Name>
							<Comment>Ручная корректировка</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыплаченностьЗарплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВыплаченностьЗарплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КартСчетаСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КартСчетаСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОткрытияКарты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>Сотрудники</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспытательныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыССотрудниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыССотрудниками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыВыплатыЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыВыплатыЗарплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЧерезКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезБанк</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыКадровыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыКадровыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПорядкиОкругления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПорядкиОкругления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Окр0_01</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсечДробнойЧасти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1ВБольшуюСторону</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВедомостьЗП/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// Процедура заполняет табличную часть
//
Процедура ЗаполнитьТабличнуюЧасть() Экспорт 
		ВидЗаполнения = ДополнительныеСвойства.ВидЗаполненияТабличнойЧасти;
	Запрос = Новый Запрос;
	
	Если ВидВыплаты = ПредопределенноеЗначение("Перечисление.ВидыВыплатыЗарплаты.ЧерезБанк")
		ИЛИ ВключаяСотрудниковЧерезБанк Тогда		
		// 1. Список физ лиц с карт счетами банка 
		// 2. Список физ лиц с начисленной заработной платой с учетом п.1
		
		Если ВидЗаполнения = "ЗаполнитьПоОстаткам" Тогда
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	КартСчетаСотрудниковСрезПоследних.ФизЛицо,
			|	КартСчетаСотрудниковСрезПоследних.Банк,
			|	МАКСИМУМ(КартСчетаСотрудниковСрезПоследних.НомерСчета) КАК НомерЛицевогоСчета
			|ПОМЕСТИТЬ ВременнаяТаблицаКартСчета
			|ИЗ
			|	РегистрСведений.КартСчетаСотрудников.СрезПоследних(&КонецПериодаРегистрации, ) КАК КартСчетаСотрудниковСрезПоследних
			|ГДЕ
			|	КартСчетаСотрудниковСрезПоследних.Банк = &Банк
			|
			|СГРУППИРОВАТЬ ПО
			|	КартСчетаСотрудниковСрезПоследних.ФизЛицо,
			|	КартСчетаСотрудниковСрезПоследних.Банк
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СотрудникиСрезПоследних.ФизЛицо,
			|	СотрудникиСрезПоследних.Подразделение,
			|	СотрудникиСрезПоследних.ВидСобытия КАК ТекущийСтатус
			|ПОМЕСТИТЬ ВременнаяТаблицаСотрудники
			|ИЗ
			|	РегистрСведений.Сотрудники.СрезПоследних(&КонецПериодаРегистрации, Организация = &Организация) КАК СотрудникиСрезПоследних
			|ГДЕ
			|	СотрудникиСрезПоследних.Подразделение = &Подразделение
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВзаиморасчетыССотрудникамиОстатки.ФизЛицо,
			|	ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаКВыплате,
			|	ВременнаяТаблицаКартСчета.НомерЛицевогоСчета,
			|	ВременнаяТаблицаСотрудники.Подразделение,
			|	ВременнаяТаблицаСотрудники.ТекущийСтатус,
			|	0 КАК ПолеДляСтрЗаменить
			|ПОМЕСТИТЬ ВременнаяТаблицаРассчитанныеСуммы
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыССотрудниками.Остатки(
			|			&КонецПериодаРегистрации,
			|			Организация = &Организация
			|				И ФизЛицо В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						ВременнаяТаблицаКартСчета.ФизЛицо
			|					ИЗ
			|						ВременнаяТаблицаКартСчета КАК ВременнаяТаблицаКартСчета)) КАК ВзаиморасчетыССотрудникамиОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаКартСчета КАК ВременнаяТаблицаКартСчета
			|		ПО ВзаиморасчетыССотрудникамиОстатки.ФизЛицо = ВременнаяТаблицаКартСчета.ФизЛицо
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаСотрудники КАК ВременнаяТаблицаСотрудники
			|		ПО ВзаиморасчетыССотрудникамиОстатки.ФизЛицо = ВременнаяТаблицаСотрудники.ФизЛицо
			|ГДЕ
			|	ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблицаРассчитанныеСуммы.ФизЛицо,
			|	ВременнаяТаблицаРассчитанныеСуммы.ПолеДляСтрЗаменить КАК СуммаКВыплате,
			|	ВременнаяТаблицаРассчитанныеСуммы.НомерЛицевогоСчета,
			|	ВременнаяТаблицаРассчитанныеСуммы.Подразделение,
			|	ВременнаяТаблицаРассчитанныеСуммы.ТекущийСтатус
			|ИЗ
			|	ВременнаяТаблицаРассчитанныеСуммы КАК ВременнаяТаблицаРассчитанныеСуммы
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////";			
				
		ИначеЕсли ВидЗаполнения = "ЗаполнитьПоОстаткамЗаМесяц" Тогда
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	КартСчетаСотрудниковСрезПоследних.ФизЛицо,
			|	КартСчетаСотрудниковСрезПоследних.Банк,
			|	МАКСИМУМ(КартСчетаСотрудниковСрезПоследних.НомерСчета) КАК НомерЛицевогоСчета
			|ПОМЕСТИТЬ ВременнаяТаблицаКартСчета
			|ИЗ
			|	РегистрСведений.КартСчетаСотрудников.СрезПоследних(&КонецПериодаРегистрации, ) КАК КартСчетаСотрудниковСрезПоследних
			|ГДЕ
			|	КартСчетаСотрудниковСрезПоследних.Банк = &Банк
			|
			|СГРУППИРОВАТЬ ПО
			|	КартСчетаСотрудниковСрезПоследних.ФизЛицо,
			|	КартСчетаСотрудниковСрезПоследних.Банк
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СотрудникиСрезПоследних.ФизЛицо,
			|	СотрудникиСрезПоследних.Подразделение,
			|	СотрудникиСрезПоследних.ВидСобытия КАК ТекущийСтатус
			|ПОМЕСТИТЬ ВременнаяТаблицаСотрудники
			|ИЗ
			|	РегистрСведений.Сотрудники.СрезПоследних(&КонецПериодаРегистрации, Организация = &Организация) КАК СотрудникиСрезПоследних
			|ГДЕ
			|	СотрудникиСрезПоследних.Подразделение = &Подразделение
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВзаиморасчетыССотрудникамиОбороты.ФизЛицо,
			|	ВременнаяТаблицаКартСчета.НомерЛицевогоСчета,
			|	СУММА(ВзаиморасчетыССотрудникамиОбороты.СуммаОборот) КАК СуммаКВыплате,
			|	ВременнаяТаблицаСотрудники.Подразделение,
			|	ВременнаяТаблицаСотрудники.ТекущийСтатус,
			|	0 КАК ПолеДляСтрЗаменить
			|ПОМЕСТИТЬ ВременнаяТаблицаРассчитанныеСуммы
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыССотрудниками.Обороты(
			|			&НачалоПериодаРегистрации,
			|			&КонецПериодаРегистрации,
			|			,
			|			Организация = &Организация
			|				И ФизЛицо В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						ВременнаяТаблицаКартСчета.ФизЛицо
			|					ИЗ
			|						ВременнаяТаблицаКартСчета КАК ВременнаяТаблицаКартСчета)) КАК ВзаиморасчетыССотрудникамиОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаКартСчета КАК ВременнаяТаблицаКартСчета
			|		ПО ВзаиморасчетыССотрудникамиОбороты.ФизЛицо = ВременнаяТаблицаКартСчета.ФизЛицо
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаСотрудники КАК ВременнаяТаблицаСотрудники
			|		ПО ВзаиморасчетыССотрудникамиОбороты.ФизЛицо = ВременнаяТаблицаСотрудники.ФизЛицо
			|ГДЕ
			|	ВременнаяТаблицаСотрудники.ТекущийСтатус <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВременнаяТаблицаКартСчета.НомерЛицевогоСчета,
			|	ВзаиморасчетыССотрудникамиОбороты.ФизЛицо,
			|	ВременнаяТаблицаСотрудники.Подразделение,
			|	ВременнаяТаблицаСотрудники.ТекущийСтатус
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	ВзаиморасчетыССотрудникамиОстатки.ФизЛицо,
			|	ВременнаяТаблицаКартСчета.НомерЛицевогоСчета,
			|	СУММА(ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток),
			|	ВременнаяТаблицаСотрудники.Подразделение,
			|	ВременнаяТаблицаСотрудники.ТекущийСтатус,
			|	0
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыССотрудниками.Остатки(
			|			&КонецПериодаРегистрации,
			|			Организация = &Организация
			|				И ФизЛицо В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						ВременнаяТаблицаКартСчета.ФизЛицо
			|					ИЗ
			|						ВременнаяТаблицаКартСчета КАК ВременнаяТаблицаКартСчета)) КАК ВзаиморасчетыССотрудникамиОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаКартСчета КАК ВременнаяТаблицаКартСчета
			|		ПО ВзаиморасчетыССотрудникамиОстатки.ФизЛицо = ВременнаяТаблицаКартСчета.ФизЛицо
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаСотрудники КАК ВременнаяТаблицаСотрудники
			|		ПО ВзаиморасчетыССотрудникамиОстатки.ФизЛицо = ВременнаяТаблицаСотрудники.ФизЛицо
			|ГДЕ
			|	ВременнаяТаблицаСотрудники.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВременнаяТаблицаКартСчета.НомерЛицевогоСчета,
			|	ВзаиморасчетыССотрудникамиОстатки.ФизЛицо,
			|	ВременнаяТаблицаСотрудники.Подразделение,
			|	ВременнаяТаблицаСотрудники.ТекущийСтатус
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблицаРассчитанныеСуммы.ФизЛицо,
			|	ВременнаяТаблицаРассчитанныеСуммы.НомерЛицевогоСчета,
			|	ВременнаяТаблицаРассчитанныеСуммы.ПолеДляСтрЗаменить КАК СуммаКВыплате,
			|	ВременнаяТаблицаРассчитанныеСуммы.Подразделение,
			|	ВременнаяТаблицаРассчитанныеСуммы.ТекущийСтатус
			|ИЗ
			|	ВременнаяТаблицаРассчитанныеСуммы КАК ВременнаяТаблицаРассчитанныеСуммы
			|ГДЕ
			|	ВременнаяТаблицаРассчитанныеСуммы.СуммаКВыплате > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////";			
			
		ИначеЕсли ВидЗаполнения = "ЗаполнитьПоВидуРасчета" Тогда	
			
		КонецЕсли;
		
	КонецЕсли;
							
	Если ВидВыплаты = ПредопределенноеЗначение("Перечисление.ВидыВыплатыЗарплаты.ЧерезКассу") Тогда 		
		// 1. Список физ лиц с карт счетами всех банков 
		// 2. Список физ лиц с начисленной заработной платой без фил лиц п.1
		
		Если ВидЗаполнения = "ЗаполнитьПоОстаткам" Тогда
			
			Если ВключаяСотрудниковЧерезБанк Тогда
				ТекстЗапроса = ТекстЗапроса +
				"
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	КартСчетаСотрудниковСрезПоследних.ФизЛицо
				|ПОМЕСТИТЬ ВременнаяТаблицаКартСчетаЧерезКассу
				|ИЗ
				|	РегистрСведений.КартСчетаСотрудников.СрезПоследних(&КонецПериодаРегистрации, ) КАК КартСчетаСотрудниковСрезПоследних
				|
				|СГРУППИРОВАТЬ ПО
				|	КартСчетаСотрудниковСрезПоследних.ФизЛицо
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СотрудникиСрезПоследних.ФизЛицо,
				|	СотрудникиСрезПоследних.Подразделение,
				|	СотрудникиСрезПоследних.ВидСобытия КАК ТекущийСтатус
				|ПОМЕСТИТЬ ВременнаяТаблицаСотрудникиЧерезКассу
				|ИЗ
				|	РегистрСведений.Сотрудники.СрезПоследних(&КонецПериодаРегистрации, Организация = &Организация) КАК СотрудникиСрезПоследних
				|ГДЕ
				|	СотрудникиСрезПоследних.Подразделение = &Подразделение
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВзаиморасчетыССотрудникамиОстатки.ФизЛицо,
				|	ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаКВыплате,
				|	ВременнаяТаблицаСотрудникиЧерезКассу.Подразделение,
				|	ВременнаяТаблицаСотрудникиЧерезКассу.ТекущийСтатус
				|ПОМЕСТИТЬ ВременнаяТаблицаСуммКВыплатеЧерезКассу
				|ИЗ
				|	РегистрНакопления.ВзаиморасчетыССотрудниками.Остатки(
				|			&КонецПериодаРегистрации,
				|			Организация = &Организация
				|				И НЕ ФизЛицо В
				|						(ВЫБРАТЬ
				|							ВременнаяТаблицаКартСчетаЧерезКассу.ФизЛицо
				|						ИЗ
				|							ВременнаяТаблицаКартСчетаЧерезКассу КАК ВременнаяТаблицаКартСчетаЧерезКассу)) КАК ВзаиморасчетыССотрудникамиОстатки
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаСотрудникиЧерезКассу КАК ВременнаяТаблицаСотрудникиЧерезКассу
				|		ПО ВзаиморасчетыССотрудникамиОстатки.ФизЛицо = ВременнаяТаблицаСотрудникиЧерезКассу.ФизЛицо
				|ГДЕ
				|	ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток > 0
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВременнаяТаблицаСуммКВыплатеЧерезКассу.ФизЛицо,
				|	ВременнаяТаблицаСуммКВыплатеЧерезКассу.СуммаКВыплате КАК СуммаКВыплате,
				|	ВременнаяТаблицаСуммКВыплатеЧерезКассу.Подразделение,
				|	ВременнаяТаблицаСуммКВыплатеЧерезКассу.ТекущийСтатус,
				|	0 КАК ПолеДляСтрЗаменить
				|ПОМЕСТИТЬ ВременнаяТаблицаРассчитанныеСуммыЧерезКассу
				|ИЗ
				|	ВременнаяТаблицаСуммКВыплатеЧерезКассу КАК ВременнаяТаблицаСуммКВыплатеЧерезКассу
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ФизЛицо,
				|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ПолеДляСтрЗаменить КАК СуммаКВыплате,
				|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.Подразделение,
				|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ТекущийСтатус
				|ИЗ
				|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу КАК ВременнаяТаблицаРассчитанныеСуммыЧерезКассу";
				
			Иначе
				ТекстЗапроса =
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	КартСчетаСотрудниковСрезПоследних.ФизЛицо
				|ПОМЕСТИТЬ ВременнаяТаблицаКартСчета
				|ИЗ
				|	РегистрСведений.КартСчетаСотрудников.СрезПоследних(&КонецПериодаРегистрации, ) КАК КартСчетаСотрудниковСрезПоследних
				|
				|СГРУППИРОВАТЬ ПО
				|	КартСчетаСотрудниковСрезПоследних.ФизЛицо
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СотрудникиСрезПоследних.ФизЛицо,
				|	СотрудникиСрезПоследних.Подразделение,
				|	СотрудникиСрезПоследних.ВидСобытия КАК ТекущийСтатус
				|ПОМЕСТИТЬ ВременнаяТаблицаСотрудники
				|ИЗ
				|	РегистрСведений.Сотрудники.СрезПоследних(&КонецПериодаРегистрации, Организация = &Организация) КАК СотрудникиСрезПоследних
				|ГДЕ
				|	СотрудникиСрезПоследних.Подразделение = &Подразделение
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВзаиморасчетыССотрудникамиОстатки.ФизЛицо,
				|	ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаКВыплате,
				|	ВременнаяТаблицаСотрудники.Подразделение,
				|	ВременнаяТаблицаСотрудники.ТекущийСтатус
				|ПОМЕСТИТЬ ВременнаяТаблицаСуммКВыплате
				|ИЗ
				|	РегистрНакопления.ВзаиморасчетыССотрудниками.Остатки(
				|			&КонецПериодаРегистрации,
				|			Организация = &Организация
				|				И НЕ ФизЛицо В
				|						(ВЫБРАТЬ
				|							ВременнаяТаблицаКартСчета.ФизЛицо
				|						ИЗ
				|							ВременнаяТаблицаКартСчета КАК ВременнаяТаблицаКартСчета)) КАК ВзаиморасчетыССотрудникамиОстатки
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаСотрудники КАК ВременнаяТаблицаСотрудники
				|		ПО ВзаиморасчетыССотрудникамиОстатки.ФизЛицо = ВременнаяТаблицаСотрудники.ФизЛицо
				|ГДЕ
				|	ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток > 0
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВременнаяТаблицаСуммКВыплате.ФизЛицо,
				|	ВременнаяТаблицаСуммКВыплате.СуммаКВыплате КАК СуммаКВыплате,
				|	ВременнаяТаблицаСуммКВыплате.Подразделение,
				|	ВременнаяТаблицаСуммКВыплате.ТекущийСтатус,
				|	0 КАК ПолеДляСтрЗаменить
				|ПОМЕСТИТЬ ВременнаяТаблицаРассчитанныеСуммы
				|ИЗ
				|	ВременнаяТаблицаСуммКВыплате КАК ВременнаяТаблицаСуммКВыплате
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВременнаяТаблицаРассчитанныеСуммы.ФизЛицо,
				|	ВременнаяТаблицаРассчитанныеСуммы.ПолеДляСтрЗаменить КАК СуммаКВыплате,
				|	ВременнаяТаблицаРассчитанныеСуммы.Подразделение,
				|	ВременнаяТаблицаРассчитанныеСуммы.ТекущийСтатус
				|ИЗ
				|	ВременнаяТаблицаРассчитанныеСуммы КАК ВременнаяТаблицаРассчитанныеСуммы";
			КонецЕсли;
				
		ИначеЕсли ВидЗаполнения = "ЗаполнитьПоОстаткамЗаМесяц" Тогда
			Если ВключаяСотрудниковЧерезБанк Тогда
				ТекстЗапроса = ТекстЗапроса +
				"
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	КартСчетаСотрудниковСрезПоследних.ФизЛицо
				|ПОМЕСТИТЬ ВременнаяТаблицаКартСчетаЧерезКассу
				|ИЗ
				|	РегистрСведений.КартСчетаСотрудников.СрезПоследних(&КонецПериодаРегистрации, ) КАК КартСчетаСотрудниковСрезПоследних
				|
				|СГРУППИРОВАТЬ ПО
				|	КартСчетаСотрудниковСрезПоследних.ФизЛицо
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СотрудникиСрезПоследних.ФизЛицо,
				|	СотрудникиСрезПоследних.Подразделение,
				|	СотрудникиСрезПоследних.ВидСобытия КАК ТекущийСтатус
				|ПОМЕСТИТЬ ВременнаяТаблицаСотрудникиЧерезКассу
				|ИЗ
				|	РегистрСведений.Сотрудники.СрезПоследних(&КонецПериодаРегистрации, Организация = &Организация) КАК СотрудникиСрезПоследних
				|ГДЕ
				|	СотрудникиСрезПоследних.Подразделение = &Подразделение
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВзаиморасчетыССотрудникамиОбороты.ФизЛицо,
				|	ВзаиморасчетыССотрудникамиОбороты.СуммаОборот КАК СуммаКВыплате,
				|	ВременнаяТаблицаСотрудникиЧерезКассу.Подразделение,
				|	ВременнаяТаблицаСотрудникиЧерезКассу.ТекущийСтатус
				|ПОМЕСТИТЬ ВременнаяТаблицаСуммКВыплатеЧерезКассу
				|ИЗ
				|	РегистрНакопления.ВзаиморасчетыССотрудниками.Обороты(
				|			&НачалоПериодаРегистрации,
				|			&КонецПериодаРегистрации,
				|			,
				|			Организация = &Организация
				|				И НЕ ФизЛицо В
				|						(ВЫБРАТЬ
				|							ВременнаяТаблицаКартСчетаЧерезКассу.ФизЛицо
				|						ИЗ
				|							ВременнаяТаблицаКартСчетаЧерезКассу КАК ВременнаяТаблицаКартСчетаЧерезКассу)) КАК ВзаиморасчетыССотрудникамиОбороты
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаСотрудникиЧерезКассу КАК ВременнаяТаблицаСотрудникиЧерезКассу
				|		ПО ВзаиморасчетыССотрудникамиОбороты.ФизЛицо = ВременнаяТаблицаСотрудникиЧерезКассу.ФизЛицо
				|ГДЕ
				|	ВременнаяТаблицаСотрудникиЧерезКассу.ТекущийСтатус <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ
				|	ВзаиморасчетыССотрудникамиОстатки.ФизЛицо,
				|	ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток,
				|	ВременнаяТаблицаСотрудникиЧерезКассу.Подразделение,
				|	ВременнаяТаблицаСотрудникиЧерезКассу.ТекущийСтатус
				|ИЗ
				|	РегистрНакопления.ВзаиморасчетыССотрудниками.Остатки(
				|			&КонецПериодаРегистрации,
				|			Организация = &Организация
				|				И НЕ ФизЛицо В
				|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|							ВременнаяТаблицаКартСчетаЧерезКассу.ФизЛицо
				|						ИЗ
				|							ВременнаяТаблицаКартСчетаЧерезКассу КАК ВременнаяТаблицаКартСчетаЧерезКассу)) КАК ВзаиморасчетыССотрудникамиОстатки
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаСотрудникиЧерезКассу КАК ВременнаяТаблицаСотрудникиЧерезКассу
				|		ПО ВзаиморасчетыССотрудникамиОстатки.ФизЛицо = ВременнаяТаблицаСотрудникиЧерезКассу.ФизЛицо
				|ГДЕ
				|	ВременнаяТаблицаСотрудникиЧерезКассу.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВременнаяТаблицаСуммКВыплатеЧерезКассу.ФизЛицо,
				|	ВременнаяТаблицаСуммКВыплатеЧерезКассу.СуммаКВыплате КАК СуммаКВыплате,
				|	ВременнаяТаблицаСуммКВыплатеЧерезКассу.Подразделение,
				|	ВременнаяТаблицаСуммКВыплатеЧерезКассу.ТекущийСтатус,
				|	0 КАК ПолеДляСтрЗаменить
				|ПОМЕСТИТЬ ВременнаяТаблицаРассчитанныеСуммыЧерезКассу
				|ИЗ
				|	ВременнаяТаблицаСуммКВыплатеЧерезКассу КАК ВременнаяТаблицаСуммКВыплатеЧерезКассу
				|ГДЕ
				|	ВременнаяТаблицаСуммКВыплатеЧерезКассу.СуммаКВыплате > 0
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ФизЛицо,
				|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ПолеДляСтрЗаменить КАК СуммаКВыплате,
				|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.Подразделение,
				|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ТекущийСтатус
				|ИЗ
				|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу КАК ВременнаяТаблицаРассчитанныеСуммыЧерезКассу";

			Иначе
				ТекстЗапроса = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	КартСчетаСотрудниковСрезПоследних.ФизЛицо
				|ПОМЕСТИТЬ ВременнаяТаблицаКартСчета
				|ИЗ
				|	РегистрСведений.КартСчетаСотрудников.СрезПоследних(&КонецПериодаРегистрации, ) КАК КартСчетаСотрудниковСрезПоследних
				|
				|СГРУППИРОВАТЬ ПО
				|	КартСчетаСотрудниковСрезПоследних.ФизЛицо
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СотрудникиСрезПоследних.ФизЛицо,
				|	СотрудникиСрезПоследних.Подразделение,
				|	СотрудникиСрезПоследних.ВидСобытия КАК ТекущийСтатус
				|ПОМЕСТИТЬ ВременнаяТаблицаСотрудники
				|ИЗ
				|	РегистрСведений.Сотрудники.СрезПоследних(&КонецПериодаРегистрации, Организация = &Организация) КАК СотрудникиСрезПоследних
				|ГДЕ
				|	СотрудникиСрезПоследних.Подразделение = &Подразделение
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВзаиморасчетыССотрудникамиОбороты.ФизЛицо,
				|	ВзаиморасчетыССотрудникамиОбороты.СуммаОборот КАК СуммаКВыплате,
				|	ВременнаяТаблицаСотрудники.Подразделение,
				|	ВременнаяТаблицаСотрудники.ТекущийСтатус
				|ПОМЕСТИТЬ ВременнаяТаблицаСуммКВыплате
				|ИЗ
				|	РегистрНакопления.ВзаиморасчетыССотрудниками.Обороты(
				|			&НачалоПериодаРегистрации,
				|			&КонецПериодаРегистрации,
				|			,
				|			Организация = &Организация
				|				И НЕ ФизЛицо В
				|						(ВЫБРАТЬ
				|							ВременнаяТаблицаКартСчета.ФизЛицо
				|						ИЗ
				|							ВременнаяТаблицаКартСчета КАК ВременнаяТаблицаКартСчета)) КАК ВзаиморасчетыССотрудникамиОбороты
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаСотрудники КАК ВременнаяТаблицаСотрудники
				|		ПО ВзаиморасчетыССотрудникамиОбороты.ФизЛицо = ВременнаяТаблицаСотрудники.ФизЛицо
				|ГДЕ
				|	ВременнаяТаблицаСотрудники.ТекущийСтатус <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ
				|	ВзаиморасчетыССотрудникамиОстатки.ФизЛицо,
				|	ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток,
				|	ВременнаяТаблицаСотрудники.Подразделение,
				|	ВременнаяТаблицаСотрудники.ТекущийСтатус
				|ИЗ
				|	РегистрНакопления.ВзаиморасчетыССотрудниками.Остатки(
				|			&КонецПериодаРегистрации,
				|			Организация = &Организация
				|				И НЕ ФизЛицо В
				|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|							ВременнаяТаблицаКартСчета.ФизЛицо
				|						ИЗ
				|							ВременнаяТаблицаКартСчета КАК ВременнаяТаблицаКартСчета)) КАК ВзаиморасчетыССотрудникамиОстатки
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаСотрудники КАК ВременнаяТаблицаСотрудники
				|		ПО ВзаиморасчетыССотрудникамиОстатки.ФизЛицо = ВременнаяТаблицаСотрудники.ФизЛицо
				|ГДЕ
				|	ВременнаяТаблицаСотрудники.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВременнаяТаблицаСуммКВыплате.ФизЛицо,
				|	ВременнаяТаблицаСуммКВыплате.СуммаКВыплате КАК СуммаКВыплате,
				|	ВременнаяТаблицаСуммКВыплате.Подразделение,
				|	ВременнаяТаблицаСуммКВыплате.ТекущийСтатус,
				|	0 КАК ПолеДляСтрЗаменить
				|ПОМЕСТИТЬ ВременнаяТаблицаРассчитанныеСуммы
				|ИЗ
				|	ВременнаяТаблицаСуммКВыплате КАК ВременнаяТаблицаСуммКВыплате
				|ГДЕ
				|	ВременнаяТаблицаСуммКВыплате.СуммаКВыплате > 0
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВременнаяТаблицаРассчитанныеСуммы.ФизЛицо,
				|	ВременнаяТаблицаРассчитанныеСуммы.ПолеДляСтрЗаменить КАК СуммаКВыплате,
				|	ВременнаяТаблицаРассчитанныеСуммы.Подразделение,
				|	ВременнаяТаблицаРассчитанныеСуммы.ТекущийСтатус
				|ИЗ
				|	ВременнаяТаблицаРассчитанныеСуммы КАК ВременнаяТаблицаРассчитанныеСуммы";
			КонецЕсли;
		ИначеЕсли ВидЗаполнения = "ЗаполнитьАвансПоПроценту" Тогда
			
		КонецЕсли;
		
	КонецЕсли;	
		
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("КонецПериодаРегистрации", Новый Граница(КонецМесяца(ДополнительныеСвойства.ПериодРегистрации)+1,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("НачалоПериодаРегистрации", НачалоМесяца(ДополнительныеСвойства.ПериодРегистрации));
	
	Если ВидВыплаты = ПредопределенноеЗначение("Перечисление.ВидыВыплатыЗарплаты.ЧерезБанк")
		И НЕ ВключаяСотрудниковЧерезБанк Тогда
		Если НЕ ЗначениеЗаполнено(БанковскийСчетПолучателя) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнен банковский счет получателя.'");
			БухгалтерскийУчетСервер.СообщитьОбОшибке(
				ЭтотОбъект,   
				ТекстСообщения,
				,
				,
				"БанковскийСчетПолучателя",
				Истина);		
			Возврат;
		
		ИначеЕсли НЕ ЗначениеЗаполнено(БанковскийСчетПолучателя.Банк) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнено поле Банк в банковском счете получателя.'");
			БухгалтерскийУчетСервер.СообщитьОбОшибке(
				ЭтотОбъект,   
				ТекстСообщения,
				,
				,
				"БанковскийСчетПолучателя",
				Истина);		
			Возврат;
			
		Иначе
			Запрос.УстановитьПараметр("Банк", БанковскийСчетПолучателя.Банк);			
		
		КонецЕсли;					
		
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КартСчетаСотрудниковСрезПоследних.Банк = &Банк", "Истина");	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Подразделение) Тогда  
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Иначе 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СотрудникиСрезПоследних.Подразделение = &Подразделение", "Истина");	
	КонецЕсли;	
	
	Если ВключаяСотрудниковЧерезБанк 
		И ВидЗаполнения = "ЗаполнитьПоОстаткам" Тогда 
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		
		"ВЫБРАТЬ
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ФизЛицо,
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ПолеДляСтрЗаменить КАК СуммаКВыплате,
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.Подразделение,
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ТекущийСтатус
		|ИЗ
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу КАК ВременнаяТаблицаРассчитанныеСуммыЧерезКассу",
		
		"ВЫБРАТЬ
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ФизЛицо,
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ПолеДляСтрЗаменить КАК СуммаКВыплате,
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.Подразделение,
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ТекущийСтатус
		|ИЗ
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу КАК ВременнаяТаблицаРассчитанныеСуммыЧерезКассу
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаРассчитанныеСуммы.ФизЛицо,
		|	ВременнаяТаблицаРассчитанныеСуммы.ПолеДляСтрЗаменить КАК СуммаКВыплате,
		|	ВременнаяТаблицаРассчитанныеСуммы.Подразделение,
		|	ВременнаяТаблицаРассчитанныеСуммы.ТекущийСтатус
		|ИЗ
		|	ВременнаяТаблицаРассчитанныеСуммы КАК ВременнаяТаблицаРассчитанныеСуммы");
		
	ИначеЕсли ВключаяСотрудниковЧерезБанк 
		И ВидЗаполнения = "ЗаполнитьПоОстаткамЗаМесяц" Тогда 
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		
		"ВЫБРАТЬ
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ФизЛицо,
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ПолеДляСтрЗаменить КАК СуммаКВыплате,
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.Подразделение,
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ТекущийСтатус
		|ИЗ
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу КАК ВременнаяТаблицаРассчитанныеСуммыЧерезКассу",
		
		"ВЫБРАТЬ
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ФизЛицо,
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ПолеДляСтрЗаменить КАК СуммаКВыплате,
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.Подразделение,
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ТекущийСтатус
		|ИЗ
		|	ВременнаяТаблицаРассчитанныеСуммыЧерезКассу КАК ВременнаяТаблицаРассчитанныеСуммыЧерезКассу
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаРассчитанныеСуммы.ФизЛицо,
		|	ВременнаяТаблицаРассчитанныеСуммы.ПолеДляСтрЗаменить КАК СуммаКВыплате,
		|	ВременнаяТаблицаРассчитанныеСуммы.Подразделение,
		|	ВременнаяТаблицаРассчитанныеСуммы.ТекущийСтатус
		|ИЗ
		|	ВременнаяТаблицаРассчитанныеСуммы КАК ВременнаяТаблицаРассчитанныеСуммы
		|ГДЕ
		|	ВременнаяТаблицаРассчитанныеСуммы.СуммаКВыплате > 0");
		
	КонецЕсли;
			
	Если ЗначениеЗаполнено(ПорядокОкругления) Тогда
		Если ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр0_01 Тогда 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВременнаяТаблицаРассчитанныеСуммы.ПолеДляСтрЗаменить", 
				"	ВЫБОР 
			|		КОГДА ВременнаяТаблицаРассчитанныеСуммы.ТекущийСтатус = Значение(Перечисление.ВидыКадровыхСобытий.Увольнение) ТОГДА ВременнаяТаблицаРассчитанныеСуммы.СуммаКВыплате
			|		ИНАЧЕ ВЫРАЗИТЬ(ВременнаяТаблицаРассчитанныеСуммы.СуммаКВыплате КАК ЧИСЛО(15, 2))
			|		КОНЕЦ");	
		
		ИначеЕсли ПорядокОкругления = Перечисления.ПорядкиОкругления.ОтсечДробнойЧасти Тогда 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВременнаяТаблицаРассчитанныеСуммы.ПолеДляСтрЗаменить", 
				"	ВЫБОР 
			|		КОГДА ВременнаяТаблицаРассчитанныеСуммы.ТекущийСтатус = Значение(Перечисление.ВидыКадровыхСобытий.Увольнение) ТОГДА ВременнаяТаблицаРассчитанныеСуммы.СуммаКВыплате
			|		ИНАЧЕ ВЫРАЗИТЬ(ВременнаяТаблицаРассчитанныеСуммы.СуммаКВыплате КАК ЧИСЛО(15, 0))
			|		КОНЕЦ");	
				
		ИначеЕсли ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр1ВБольшуюСторону Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВременнаяТаблицаРассчитанныеСуммы.ПолеДляСтрЗаменить",
				"	ВЫБОР 
			|		КОГДА ВременнаяТаблицаРассчитанныеСуммы.ТекущийСтатус = Значение(Перечисление.ВидыКадровыхСобытий.Увольнение) ТОГДА ВременнаяТаблицаРассчитанныеСуммы.СуммаКВыплате
			|		ИНАЧЕ (ВЫРАЗИТЬ(ВременнаяТаблицаРассчитанныеСуммы.СуммаКВыплате КАК ЧИСЛО(15, 0))) + ВЫБОР
			|		КОГДА ВременнаяТаблицаРассчитанныеСуммы.СуммаКВыплате - (ВЫРАЗИТЬ(ВременнаяТаблицаРассчитанныеСуммы.СуммаКВыплате КАК ЧИСЛО(15, 0))) > 0
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ
			|		КОНЕЦ");			
			
		КонецЕсли;			
		
		Если ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр0_01 Тогда 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ПолеДляСтрЗаменить", 
				"	ВЫБОР 
			|		КОГДА ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ТекущийСтатус = Значение(Перечисление.ВидыКадровыхСобытий.Увольнение) ТОГДА ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.СуммаКВыплате
			|		ИНАЧЕ ВЫРАЗИТЬ(ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.СуммаКВыплате КАК ЧИСЛО(15, 2))
			|		КОНЕЦ");	
		
		ИначеЕсли ПорядокОкругления = Перечисления.ПорядкиОкругления.ОтсечДробнойЧасти Тогда 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ПолеДляСтрЗаменить", 
				"	ВЫБОР 
			|		КОГДА ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ТекущийСтатус = Значение(Перечисление.ВидыКадровыхСобытий.Увольнение) ТОГДА ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.СуммаКВыплате
			|		ИНАЧЕ ВЫРАЗИТЬ(ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.СуммаКВыплате КАК ЧИСЛО(15, 0))
			|		КОНЕЦ");	
				
		ИначеЕсли ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр1ВБольшуюСторону Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.ПолеДляСтрЗаменить",
				"	ВЫБОР 
			|		КОГДА ВременнаяТаблицаРассчитанныеСуммы.ТекущийСтатус = Значение(Перечисление.ВидыКадровыхСобытий.Увольнение) ТОГДА ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.СуммаКВыплате
			|		ИНАЧЕ (ВЫРАЗИТЬ(ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.СуммаКВыплате КАК ЧИСЛО(15, 0))) + ВЫБОР
			|		КОГДА ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.СуммаКВыплате - (ВЫРАЗИТЬ(ВременнаяТаблицаРассчитанныеСуммыЧерезКассу.СуммаКВыплате КАК ЧИСЛО(15, 0))) > 0
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ
			|		КОНЕЦ");			
			
		КонецЕсли;			
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ЗаполнитьТабличнуюЧасть()

// Выполняет контроль противоречий.
//
Процедура ВыполнитьПредварительныйКонтроль(Отказ)
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектов.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	Если НЕ ЗначениеЗаполнено(ПорядокОкругления) Тогда
		ПорядокОкругления = Перечисления.ПорядкиОкругления.ОтсечДробнойЧасти;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПериодРегистрации) Тогда
		Если ЗначениеЗаполнено(Дата) Тогда
			ПериодРегистрации = НачалоМесяца(Дата);
		Иначе
			ПериодРегистрации = НачалоМесяца(ТекущаяДата());		
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	БухгалтерскийУчетСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.ВедомостьЗП.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	БухгалтерскийУчетСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	БухгалтерскийУчетСервер.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ); 
	
	// Запись наборов записей.
	БухгалтерскийУчетСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для удаления проведения документа
	БухгалтерскийУчетСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	БухгалтерскийУчетСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	БухгалтерскийУчетСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
КонецПроцедуры

// В обработчике события ОбработкаПроверкиЗаполнения документа выполняется
// копирование и обнуление проверяемых реквизитов для исключения стандартной
// проверки заполнения платформой и последующей проверки средствами встроенного языка.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	ПроверяемыеРеквизиты.Добавить("Зарплата");
	
	// Предварительный контроль
	ВыполнитьПредварительныйКонтроль(Отказ);	
	
	Если ВидВыплаты = ПредопределенноеЗначение("Перечисление.ВидыВыплатыЗарплаты.ЧерезБанк") Тогда 
		БухгалтерскийУчетСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Касса");
	Иначе 
		БухгалтерскийУчетСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "БанковскийСчет");
	КонецЕсли;	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Зарплата.Итог("СуммаКВыплате");
КонецПроцедуры

#КонецОбласти

#КонецЕсли
